#2016
#인성2, 리더십2, 의사소통4, 창의와 사유2, SW기초 4,기본영어4, 전문글로벌2, 인간문화3, 사회역사3, 과학기술3, 기초자연과학21
#sixteenVersion 내부 리스트 순서는 인성(0), 리더십(1), 의사소통(2), 창의와 사유(3), SW기초(4), 기본영어(5)
#전문글로벌(6), 인간/문화(7), 사회/역사(8), 과학/기술(9), 기초자연과학(10)
sixteenVersion = [
{'insung' : ['성균논어', '인성고전']}, 
{'leadership' : ['실천리더십', '앙트레프레너십과리더십', '이론리더십']}, 
{'communication' : ['과학기술글쓰기', '담화와언어', '미디어글쓰기', '발표와매체언어', '발표와토의', '스피치와토론', '시민법정토론', '의사소통1', '의사소통2', '의사소통3', '의사소통4',
'창의적글쓰기', '학술적글쓰기', '한국어말소리와언어예절', '한국어매체읽기', '한국어문서작성', '여행과글쓰기', '한국어화법과예절', '발표와토론1', '발표와토론2']}, 
{'creativity' : ['사고와표현', '창의와사유의기초', '창의적사고', '창의적융합디자인', '기호논리학', '비판적사고', '통계적사고', '일반논리학', '수리적사고', '창의적발상', '창의성이해']}, 
{'swBasic' : ['공학컴퓨터프로그래밍', '프로그래밍기초와실습', '컴퓨팅사고와SW코딩','문제해결과알고리즘', 'AI기초와활용']}, 
{'englishBasic' : ['영어쓰기', '영어발표']}, 
{'englishExpert' : ['고급영어쓰기', '과학영어', '글로벌시대의문화이해', '글로벌영어', '글로벌화와21세기중국', '뉴스와미디어의이해', '동아시아역사와문화', '문예영어', '미국사회와법', '법률영어', '비즈니스영어', '스페인어문화권의사회와문화',
'스포츠영어', '앙트레프레너십영어', '영어토론', '유럽사회와문화', '이슬람세계의사상과문화', '인도문명권의사상과문화', '커리어영어', '한국문화와언어', '현대사회의인권과평등', '현대세계와글로벌시각', '현대중국사회의이해', '시사영어', '중앙아시아와몽골의이해']}, 
{'human' : ['주역과현대문명', '근대동아시아비교문화론', '몸과문화', '미학과창의경영', 'MBSR명상', '게임과인문학 ', '고전속의자유', '고전속의행복', '그리스로마신화의이해', '기후변화와인문학', '노벨문학상과인문융합', '논어와인생', '다큐멘터리영화비평',
'대중예술의이해', '대중음악의이해', '독일문화의이해', '동서양의세계유산', '동서양인문전통속의감정과윤리', '동서양지식문화의이해', '동아시아문학의이해', '동아시아의상호소통과한자문명', '동아시아의전통사상', '동양의예술과삶', '동양의지혜',
'디지털시대의융합예술', '러시아문화의이해', '명상과치유', '문예창작의이해', '문화사와철학사상', '문화인류학', '뮤지컬과오페라', '북유럽신화의이해', '비교종교학의이해', '사랑과문학', '사랑의심리', '생명의료윤리', '성의심리학', '세계의정원과문화', '시문학과예술가곡',
'아동의심리와교육', '여성의역사와문학,예술', '연극과문화', '영미문화의이해', '예술과4차산업혁명', '예술로보는동아시아', '예술사', '예술사와철학사상', '예술의말과생각', '유럽고도의역사와문화', '음악의이해', '인문학고전읽기', '일본문화의이해', '종교와유럽문화', '죽음과문화',
'중국문화의이해', '지식정보학', '프랑스문화의이해', '프로이트와현대문화', '한국고전문학', '한국과중국', '한국문화의이해', '한국사상과문화의이해', '한국사회와미디어', '한국의문화유산과공간', '한국현대문학', '한시의이해', '한자와한문의세계']},
{'society' : ['사회심리학', '정보사회의이해','현대사회의이해', '현대사회와직업', '가족과생활환경', '자치와협동의사회과학', '한국생활의안내및진로지도1', '국제인권', '동아시아역사와문화', '4차산업혁명과법의이해', 'AI와경영의사결정', 'ESG경영', '경제학의고전과현대적이슈',
'고전속의미디어와언론의자유', '고전속의정의', '공학경제', '근대성과현대문화', '글로벌무역의이해', '기술시대의회계', '기업가정신', '기업과증권시장의이해', '나와역사', '다문화사회의이해', '대격변의시대', '대중매체의이해', '동양의역사와문명', '미디어와윤리',
'미래사회와창의혁신인재', '민주사회와행정', '북한경제의이해', '사회과학고전읽기', '서양의역사와문명', '성격과적응', '세계사속의중국', '소비와윤리', '여성과사회', '유교자본주의의이해', '인간과토지의문명사', '인구와가족의역사', '일상생활의역사', '전쟁과문화',
'정치경제학의이해', '직업생활과법', '통일문제의이해', '한국경제의이해', '한국사개설', '한국사회풍속사', '한국역사의이해', '한국전통사회의정치문화', '현대가족의이해', '현대동아시아정치경제변동', '현대민주주의의이해', '현대사회와법', '현대사회와법의정신', '현대사회와복지',
'현대사회와헌법의이해', '현대사회유학의이해', '현대사회의문제', '현대중국사회와문화', '현대한국정치의쟁점']},
{'science' : ['과학기술과인간문화', '인간과자연환경', '창업이론과실제', '실학과수원화성의과학성이해', '동아시아과학사상의기초', '한국문화와창업가정신', '코스모스와인간', '마음뇌컴퓨터', '인공지능의이해', '4차산업혁명과과학문화', '테크놀러지의철학적이해', '특허와창업',
'산업혁명과사회문화', '우주론', '문명과자연환경', '과학기술과사회윤리', '과학기술산업화의역사', '약과건강', '생활속의양자', '생태계와환경', '생활속의화학', '암의과학', '인간-컴퓨터상호작용의이해', '과학기술과창업경영', '현대천문학개론', '스포츠마케팅과미디어', '과학사',
'화학과생명현상', '생명진화의철학', '환경과건강', '기후와문화', '자연과학고전읽기', '융복합시대의창업', '생활속의에너지', '운동과건강', '유전자재조합의이해', '인공지능을위한기초수학', '생명의기원과본질', '지속가능에너지화학', '생명공학의이해',
'생명과음식의과학', '생명의과학', '법의학으로보는사회의이해', '핵과학과핵에너지']}, 
{'scienceBasic' : ['고급미분적분학1', '고급미분적분학2', '고급생명과학1', '고급생명과학2', '공학수학1', '공학수학2', '미분적분학1', '미분적분학2', '빅데이터와통계학', '생명과학1', '생명과학2', '선형대수학', '이산수학', '일반물리학1', '일반물리학2', '일반화학1',
'일반화학2', '확률및통계', '미분적분학실습1', '미분적분학실습2', '생명과학실험1', '생명과학실험2', '일반물리학실험1', '일반물리학실험2', '일반화학실험1', '일반화학실험2']}]

#2017~2019
#인성2, 리더십2, 의사소통4, 창의와 사유2, 기본영어4, 전문글로벌2, 인간문화3, 사회역사3, 과학기술3, 기초자연과학24
#seventeenVersion 내부 리스트 순서는 인성(0), 리더십(1), 의사소통(2), 창의와 사유(3), 기본영어(4)
#전문글로벌(5), 인간/문화(6), 사회/역사(7), 과학/기술(8), 기초자연과학(9)
seventeenVersion = [
{'insung' : ['성균논어', '인성고전']}, 
{'leadership' : ['실천리더십', '앙트레프레너십과리더십', '이론리더십']}, 
{'communication' : ['과학기술글쓰기', '담화와언어', '미디어글쓰기', '발표와매체언어', '발표와토의', '스피치와토론', '시민법정토론', '의사소통1', '의사소통2', '의사소통3', '의사소통4',
'창의적글쓰기', '학술적글쓰기', '한국어말소리와언어예절', '한국어매체읽기', '한국어문서작성', '여행과글쓰기', '한국어화법과예절', '발표와토론1', '발표와토론2']}, 
{'creativity' : ['사고와표현', '창의와사유의기초', '창의적사고', '창의적융합디자인', '기호논리학', '비판적사고', '통계적사고', '일반논리학', '수리적사고', '창의적발상', '창의성이해']},  
{'englishBasic' : ['영어쓰기', '영어발표']}, 
{'englishExpert' : ['고급영어쓰기', '과학영어', '글로벌시대의문화이해', '글로벌영어', '글로벌화와21세기중국', '뉴스와미디어의이해', '동아시아역사와문화', '문예영어', '미국사회와법', '법률영어', '비즈니스영어', '스페인어문화권의사회와문화',
'스포츠영어', '앙트레프레너십영어', '영어토론', '유럽사회와문화', '이슬람세계의사상과문화', '인도문명권의사상과문화', '커리어영어', '한국문화와언어', '현대사회의인권과평등', '현대세계와글로벌시각', '현대중국사회의이해', '시사영어', '중앙아시아와몽골의이해']}, 
{'human' : ['주역과현대문명', '근대동아시아비교문화론', '몸과문화', '미학과창의경영', 'MBSR명상', '게임과인문학 ', '고전속의자유', '고전속의행복', '그리스로마신화의이해', '기후변화와인문학', '노벨문학상과인문융합', '논어와인생', '다큐멘터리영화비평',
'대중예술의이해', '대중음악의이해', '독일문화의이해', '동서양의세계유산', '동서양인문전통속의감정과윤리', '동서양지식문화의이해', '동아시아문학의이해', '동아시아의상호소통과한자문명', '동아시아의전통사상', '동양의예술과삶', '동양의지혜',
'디지털시대의융합예술', '러시아문화의이해', '명상과치유', '문예창작의이해', '문화사와철학사상', '문화인류학', '뮤지컬과오페라', '북유럽신화의이해', '비교종교학의이해', '사랑과문학', '사랑의심리', '생명의료윤리', '성의심리학', '세계의정원과문화', '시문학과예술가곡',
'아동의심리와교육', '여성의역사와문학,예술', '연극과문화', '영미문화의이해', '예술과4차산업혁명', '예술로보는동아시아', '예술사', '예술사와철학사상', '예술의말과생각', '유럽고도의역사와문화', '음악의이해', '인문학고전읽기', '일본문화의이해', '종교와유럽문화', '죽음과문화',
'중국문화의이해', '지식정보학', '프랑스문화의이해', '프로이트와현대문화', '한국고전문학', '한국과중국', '한국문화의이해', '한국사상과문화의이해', '한국사회와미디어', '한국의문화유산과공간', '한국현대문학', '한시의이해', '한자와한문의세계']},
{'society' : ['사회심리학', '정보사회의이해','현대사회의이해', '현대사회와직업', '가족과생활환경', '자치와협동의사회과학', '한국생활의안내및진로지도1', '국제인권', '동아시아역사와문화', '4차산업혁명과법의이해', 'AI와경영의사결정', 'ESG경영', '경제학의고전과현대적이슈',
'고전속의미디어와언론의자유', '고전속의정의', '공학경제', '근대성과현대문화', '글로벌무역의이해', '기술시대의회계', '기업가정신', '기업과증권시장의이해', '나와역사', '다문화사회의이해', '대격변의시대', '대중매체의이해', '동양의역사와문명', '미디어와윤리',
'미래사회와창의혁신인재', '민주사회와행정', '북한경제의이해', '사회과학고전읽기', '서양의역사와문명', '성격과적응', '세계사속의중국', '소비와윤리', '여성과사회', '유교자본주의의이해', '인간과토지의문명사', '인구와가족의역사', '일상생활의역사', '전쟁과문화',
'정치경제학의이해', '직업생활과법', '통일문제의이해', '한국경제의이해', '한국사개설', '한국사회풍속사', '한국역사의이해', '한국전통사회의정치문화', '현대가족의이해', '현대동아시아정치경제변동', '현대민주주의의이해', '현대사회와법', '현대사회와법의정신', '현대사회와복지',
'현대사회와헌법의이해', '현대사회유학의이해', '현대사회의문제', '현대중국사회와문화', '현대한국정치의쟁점']},
{'science' : ['과학기술과인간문화', '인간과자연환경', '창업이론과실제', '실학과수원화성의과학성이해', '동아시아과학사상의기초', '한국문화와창업가정신', '코스모스와인간', '마음뇌컴퓨터', '인공지능의이해', '4차산업혁명과과학문화', '테크놀러지의철학적이해', '특허와창업',
'산업혁명과사회문화', '우주론', '문명과자연환경', '과학기술과사회윤리', '과학기술산업화의역사', '약과건강', '생활속의양자', '생태계와환경', '생활속의화학', '암의과학', '인간-컴퓨터상호작용의이해', '과학기술과창업경영', '현대천문학개론', '스포츠마케팅과미디어', '과학사',
'화학과생명현상', '생명진화의철학', '환경과건강', '기후와문화', '자연과학고전읽기', '융복합시대의창업', '생활속의에너지', '운동과건강', '유전자재조합의이해', '인공지능을위한기초수학', '생명의기원과본질', '지속가능에너지화학', '생명공학의이해',
'생명과음식의과학', '생명의과학', '법의학으로보는사회의이해', '핵과학과핵에너지']}, 
{'scienceBasic' : ['공학컴퓨터프로그래밍', '프로그래밍기초와실습', '고급미분적분학1', '고급미분적분학2', '고급생명과학1', '고급생명과학2', '공학수학1', '공학수학2', '미분적분학1', '미분적분학2', '빅데이터와통계학', '생명과학1', '생명과학2', '선형대수학', '이산수학', '일반물리학1', '일반물리학2', '일반화학1',
'일반화학2', '확률및통계', '미분적분학실습1', '미분적분학실습2', '생명과학실험1', '생명과학실험2', '일반물리학실험1', '일반물리학실험2', '일반화학실험1', '일반화학실험2']}]

#2020
#인성/리더십2, 고전/명저3, 의사소통4, 창의3, 미래(SW)8, 글로벌6, 인간문화3, 사회역사3, 과학기술3, 자연과학18
#secondVersion 내부 리스트 순서는 인성(0), 고전(1), 의사소통(2), 창의(3), 미래(SW)(4), 글로벌(5), 인간/문화(6), 사회/역사(7), 과학/기술(8), 기초자연과학(9)
secondVersion = [
{'insung' : ['성균논어', '실천리더십', '앙트레프레너십과리더십']},
{'classic' : ['고전명저북클럽']},
{'communication' : ['과학기술글쓰기', '담화와언어', '미디어글쓰기', '발표와매체언어', '발표와토의', '스피치와토론', '시민법정토론', '발표와토론1', '발표와토론2', '의사소통1', '의사소통2', '의사소통3', '의사소통4', '창의적글쓰기', '학술적글쓰기', '한국어말소리와언어예절', '한국어매체읽기', '한국어문서작성']},
{'creativity' : ['사고와표현', '창의와사유의기초', '창의적발상', '창의적사고', '창의적융합디자인']},
{'future' : ['공학컴퓨터프로그래밍', '프로그래밍기초와실습', '컴퓨팅사고와SW코딩', '문제해결과알고리즘', 'AI기초와활용']},
{'global' : ['고급영어쓰기', '과학영어', '글로벌시대의문화이해', '글로벌영어', '글로벌화와21세기중국', '뉴스와미디어의이해', '동아시아역사와문화', '문예영어', '미국사회와법', '법률영어', '비즈니스영어', '스페인어문화권의사회와문화', '스포츠영어', '앙트레프레너십영어',
'영어토론', '영어발표', '유럽사회와문화', '이슬람세계의사상과문화', '인도문명권의사상과문화', '커리어영어', '한국문화와언어', '현대사회의인권과평등', '현대세계와글로벌시각', '현대중국사회의이해', '영어쓰기']},
{'human' : ['MBSR명상', '게임과인문학 ', '고전속의자유', '고전속의행복', '그리스로마신화의이해', '기후변화와인문학', '노벨문학상과인문융합', '논어와인생', '다큐멘터리영화비평', '대중예술의이해', '대중음악의이해', '독일문화의이해', '동서양의세계유산', '동서양인문전통속의감정과윤리',
'동서양지식문화의이해', '동아시아문학의이해', '동아시아의상호소통과한자문명', '동아시아의전통사상', '동양의예술과삶', '동양의지혜', '디지털시대의융합예술', '러시아문화의이해', '명상과치유', '문예창작의이해', '문화사와철학사상', '문화인류학',
'뮤지컬과오페라', '북유럽신화의이해', '비교종교학의이해', '사랑과문학', '사랑의심리', '생명의료윤리', '성의심리학', '세계의정원과문화', '시문학과예술가곡', '아동의심리와교육', '여성의역사와문학,예술', '연극과문화', '영미문화의이해',
'예술과4차산업혁명', '예술로보는동아시아', '예술사', '예술사와철학사상', '예술의말과생각', '유럽고도의역사와문화', '음악의이해', '인문학고전읽기', '일본문화의이해', '종교와유럽문화', '죽음과문화', '중국문화의이해', '지식정보학',
'프랑스문화의이해', '프로이트와현대문화', '한국고전문학', '한국과중국', '한국문화의이해', '한국사상과문화의이해', '한국사회와미디어', '한국의문화유산과공간', '한국현대문학', '한시의이해', '한자와한문의세계']},
{'society' : ['4차산업혁명과법의이해', 'AI와경영의사결정', 'ESG경영', '가족과생활환경', '경제학의고전과현대적이슈', '고전속의미디어와언론의자유', '고전속의정의', '공학경제', '국제인권', '근대성과현대문화', '글로벌무역의이해', '기술시대의회계', '기업가정신', '기업과증권시장의이해', '나와역사',
'다문화사회의이해', '대격변의시대', '대중매체의이해', '동양의역사와문명', '미디어와윤리', '미래사회와창의혁신인재', '민주사회와행정', '북한경제의이해', '사회과학고전읽기', '서양의역사와문명', '성격과적응', '세계사속의중국', '소비와윤리', '여성과사회', '유교자본주의의이해',
'인간과토지의문명사', '인구와가족의역사', '일상생활의역사', '전쟁과문화', '정치경제학의이해', '직업생활과법', '통일문제의이해', '한국경제의이해', '한국사개설', '한국사회풍속사', '한국생활의안내및진로지도1', '한국역사의이해', '한국전통사회의정치문화', '현대가족의이해',
'현대동아시아정치경제변동', '현대민주주의의이해', '현대사회와법', '현대사회와법의정신', '현대사회와복지', '현대사회와직업', '현대사회와헌법의이해', '현대사회유학의이해', '현대사회의문제', '현대중국사회와문화', '현대한국정치의쟁점']},
{'science' : ['4차산업혁명과과학문화', '테크놀러지의철학적이해', '특허와창업', '산업혁명과사회문화', '우주론', '문명과자연환경', '과학기술과사회윤리', '과학기술산업화의역사', '약과건강', '생활속의양자', '생태계와환경', '생활속의화학', '암의과학',
'인간-컴퓨터상호작용의이해', '과학기술과창업경영', '현대천문학개론', '스포츠마케팅과미디어', '과학사', '화학과생명현상', '생명진화의철학', '환경과건강', '기후와문화', '자연과학고전읽기', '융복합시대의창업', '생활속의에너지', '운동과건강', '유전자재조합의이해',
'인공지능을위한기초수학', '생명의기원과본질', '지속가능에너지화학', '생명공학의이해', '생명과음식의과학', '생명의과학', '법의학으로보는사회의이해', '핵과학과핵에너지', '코스모스와인간', '인간과자연환경', '실학과수원화성의과학성이해']},
{'scienceBasic' : ['고급미분적분학1', '고급미분적분학2', '고급생명과학1', '고급생명과학2', '공학수학1', '공학수학2', '미분적분학1', '미분적분학2', '빅데이터와통계학', '생명과학1', '생명과학2', '선형대수학', '이산수학', '일반물리학1', '일반물리학2', '일반화학1', '일반화학2',
'확률및통계', '미분적분학실습1', '미분적분학실습2', '생명과학실험1', '생명과학실험2', '일반물리학실험1', '일반물리학실험2', '일반화학실험1', '일반화학실험2']}]

#2021,2022
#인성/리더십2, 고전/명저3, 의사소통4, 창의3, DS수업11, 글로벌6, 인간문화/사회역사/과학기술6, 인문사회/자연과학18
#DS기반 수업으로 소프트웨어 학생은 필수로 공컴프, 프기실, AI기초활용,데이터분석기초를 들어야함
#thirdVersion 내부 리스트 순서는 인성(0), 고전(1), 의사소통(2), 창의(3), DS수업(4), 글로벌(5), 인간/문화,사회/역사,과학/기술(6), 인문사회/기초자연과학(7)
thirdVersion = [
{'insung' : ['성균논어', '실천리더십', '앙트레프레너십과리더십']},
{'classic' : ['고전명저북클럽']},
{'communication' : ['과학기술글쓰기', '담화와언어', '미디어글쓰기', '발표와매체언어', '발표와토의', '스피치와토론', '시민법정토론', '의사소통1', '의사소통2', '의사소통3', '의사소통4', '창의적글쓰기', '학술적글쓰기', '한국어말소리와언어예절', '한국어매체읽기', '한국어문서작성']},
{'creativity' : ['사고와표현', '창의와사유의기초', '창의적사고', '창의적융합디자인']},
{'ds' : ['공학컴퓨터프로그래밍', '프로그래밍기초와실습', 'AI기초와활용', '데이터분석기초']},
{'global' : ['고급영어쓰기', '과학영어', '글로벌시대의문화이해', '글로벌영어', '글로벌화와21세기중국', '뉴스와미디어의이해', '동아시아역사와문화', '문예영어', '미국사회와법', '법률영어', '비즈니스영어', '스페인어문화권의사회와문화', '스포츠영어', '앙트레프레너십영어',
'영어토론', '영어발표', '유럽사회와문화', '이슬람세계의사상과문화', '인도문명권의사상과문화', '커리어영어', '한국문화와언어', '현대사회의인권과평등', '현대세계와글로벌시각', '현대중국사회의이해', '영어쓰기']},
{'total' : ['MBSR명상', '게임과인문학 ', '고전속의자유', '고전속의행복', '그리스로마신화의이해', '기후변화와인문학', '노벨문학상과인문융합', '논어와인생', '다큐멘터리영화비평', '대중예술의이해', '대중음악의이해', '독일문화의이해', '동서양의세계유산', '동서양인문전통속의감정과윤리',
'동서양지식문화의이해', '동아시아문학의이해', '동아시아의상호소통과한자문명', '동아시아의전통사상', '동양의예술과삶', '동양의지혜', '디지털시대의융합예술', '러시아문화의이해', '명상과치유', '문예창작의이해',
'문화사와철학사상', '문화인류학', '뮤지컬과오페라', '북유럽신화의이해', '비교종교학의이해', '사랑과문학', '사랑의심리', '생명의료윤리', '성의심리학', '세계의정원과문화', '시문학과예술가곡', '아동의심리와교육', '여성의역사와문학,예술',
'연극과문화', '영미문화의이해', '예술과4차산업혁명', '예술로보는동아시아', '예술사', '예술사와철학사상', '예술의말과생각', '유럽고도의역사와문화', '음악의이해', '인문학고전읽기', '일본문화의이해', '종교와유럽문화', '죽음과문화', '중국문화의이해', '지식정보학', '프랑스문화의이해',
'프로이트와현대문화', '한국고전문학', '한국과중국', '한국문화의이해', '한국사상과문화의이해', '한국사회와미디어', '한국의문화유산과공간', '한국현대문학', '한시의이해', '한자와한문의세계', '4차산업혁명과법의이해', 'AI와경영의사결정', 'ESG경영', '경제학의고전과현대적이슈',
'고전속의미디어와언론의자유', '고전속의정의', '공학경제', '근대성과현대문화', '글로벌무역의이해', '기술시대의회계', '기업가정신', '기업과증권시장의이해', '나와역사', '다문화사회의이해', '대격변의시대', '대중매체의이해', '동양의역사와문명', '미디어와윤리',
'미래사회와창의혁신인재', '민주사회와행정', '북한경제의이해', '사회과학고전읽기', '서양의역사와문명', '성격과적응', '세계사속의중국', '소비와윤리', '여성과사회', '유교자본주의의이해', '인간과토지의문명사', '인구와가족의역사',
'일상생활의역사', '전쟁과문화', '정치경제학의이해', '직업생활과법', '통일문제의이해', '한국경제의이해', '한국사개설', '한국사회풍속사', '한국역사의이해', '한국전통사회의정치문화', '현대가족의이해', '현대동아시아정치경제변동', '현대민주주의의이해', '현대사회와법',
'현대사회와법의정신', '현대사회와복지', '현대사회와헌법의이해', '현대사회유학의이해', '현대사회의문제', '현대중국사회와문화', '현대한국정치의쟁점', '4차산업혁명과과학문화', '테크놀러지의철학적이해', '특허와창업', '산업혁명과사회문화', '우주론', '문명과자연환경',
'과학기술과사회윤리', '과학기술산업화의역사', '약과건강', '생활속의양자', '생태계와환경', '생활속의화학', '암의과학', '인간-컴퓨터상호작용의이해', '과학기술과창업경영', '현대천문학개론', '스포츠마케팅과미디어', '과학사', '화학과생명현상', '생명진화의철학', '환경과건강',
'기후와문화', '자연과학고전읽기', '융복합시대의창업', '생활속의에너지', '운동과건강', '유전자재조합의이해', '인공지능을위한기초수학', '생명의기원과본질', '지속가능에너지화학', '생명공학의이해','생명과음식의과학', '생명의과학', '법의학으로보는사회의이해', '핵과학과핵에너지']},
{'totalbasic' : ['경제학입문', '기초독어1', '기초독어2', '기초러시아어1', '기초러시아어2', '기초일본어1', '기초일본어2', '기초중국어1', '기초중국어2', '기초프랑스어1', '기초프랑스어2', '기초한문', '동양사상입문', '라틴어', '문학입문', '사회과학입문', '사회학입문', '심리학입문',
'언어학입문', '역사학입문', '예술학입문', '정치학입문', '철학입문', '희랍어', '고급미분적분학1', '고급미분적분학2', '고급생명과학1', '고급생명과학2', '공학수학1', '공학수학2', '미분적분학1', '미분적분학2', '빅데이터와통계학', '생명과학1', '생명과학2', '선형대수학', '이산수학',
'일반물리학1', '일반물리학2', '일반화학1', '일반화학2', '확률및통계', '미분적분학실습1', '미분적분학실습2', '생명과학실험1', '생명과학실험2', '일반물리학실험1', '일반물리학실험2', '일반화학실험1', '일반화학실험2']}]


